z = c(9, 90, 900, 950, 8000, 9, 90, 99, 90, 99)
a = c(10, 100, 1000, 1000, 10000, 10, 100, 100, 100, 100)
p = c(0.5, 0.5, 0.5, 0.5, 0.5, 0.45, 0.45, 0.45, 0.4, 0.4)
q = c(0.5, 0.5, 0.5, 0.5, 0.5, 0.55, 0.55, 0.55, 0.6, 0.6)

qz = ifelse(
  p==0.5,
  (a - z) / a,
  ((q/p)^a - (q/p)^z) / ((q/p)^a - 1)
)

qz = round (qz, 3)  #round qz for 3 digit

Dz = ifelse(
  p==0.5,
  z*(a-z),
  (z / (q - p)) - (a / (q - p)) * (1 - (q/p)^z) / (1 - (q/p)^a)
)

data.frame(
  z = z,
  a = a,
  p = p,
  q = q,
  qz = qz,
  pz = 1 - qz,
  Dz = ceiling(Dz) # 5.5 কে 6 দেখাবে
)